evidence/perf/dflash2-20260819T014205Z/dedicated-c1-r2.log
EXTRA_BODY {"chat_template_kwargs":{"enable_thinking":false}}
/sgl-workspace/sglang/python/sglang/srt/environ.py:1402: UserWarning: Environment variable SGLANG_FLASHINFER_PR4266_SOURCE has been deprecated.
  warnings.warn(f"Environment variable {old_name} has been deprecated.")
W0819 01:42:49.938000 791 torch/utils/_pytree.py:630] <enum 'KernelPreference'> is an Enum subclass and is now natively supported by torch.compile as an opaque value type. Calling register_constant() on Enum subclasses is deprecated and will be an error in a future release.
W0819 01:42:49.957000 791 torch/utils/_pytree.py:630] <enum 'ScaleCalculationMode'> is an Enum subclass and is now natively supported by torch.compile as an opaque value type. Calling register_constant() on Enum subclasses is deprecated and will be an error in a future release.
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='qwen38-27b', served_model_name=None, tokenizer='/model', num_prompts=1, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=512, random_output_len=2048, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file='/tmp/dflash2-20260819T014205Z-qwen38-dedicated-c1-r2.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=0, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"chat_template_kwargs":{"enable_thinking":false}}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.
Fail to load tokenizer config with error=qwen38-27b is not a local folder and is not a valid model identifier listed on 'https://huggingface.co/models'
If this is a private repository, make sure to pass a token having permission to this repo either by logging in with `hf auth login` or by passing `token=<your_token>`

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='qwen38-27b', served_model_name=None, tokenizer='/model', num_prompts=1, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=512, random_output_len=2048, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file='/tmp/dflash2-20260819T014205Z-qwen38-dedicated-c1-r2.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=0, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"chat_template_kwargs":{"enable_thinking":false}}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 173
#Output tokens: 560
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 1/1 [00:19<00:00, 19.59s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    inf       
Max request concurrency:                 1         
Successful requests:                     1         
Benchmark duration (s):                  19.68     
Total input tokens:                      173       
Total input text tokens:                 173       
Total generated tokens:                  560       
Total generated tokens (retokenized):    543       
Request throughput (req/s):              0.05      
Input token throughput (tok/s):          8.79      
Output token throughput (tok/s):         28.46     
Peak output token throughput (tok/s):    9.00      
Peak concurrent requests:                1         
Total token throughput (tok/s):          37.25     
Concurrency:                             1.00      
Accept length:                           2.89      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   19586.62  
Median E2E Latency (ms):                 19586.62  
P90 E2E Latency (ms):                    19586.62  
P95 E2E Latency (ms):                    19586.62  
P99 E2E Latency (ms):                    19586.62  
---------------Time to First Token----------------
Mean TTFT (ms):                          209.98    
Median TTFT (ms):                        209.98    
P90 TTFT (ms):                           209.98    
P95 TTFT (ms):                           209.98    
P99 TTFT (ms):                           209.98    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.66     
Median TPOT (ms):                        34.66     
P90 TPOT (ms):                           34.66     
P95 TPOT (ms):                           34.66     
P99 TPOT (ms):                           34.66     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           35.42     
Median ITL (ms):                         22.35     
P90 ITL (ms):                            57.02     
P95 ITL (ms):                            112.78    
P99 ITL (ms):                            114.09    
Max ITL (ms):                            562.73    
==================================================
  qwen38-dedicated-c1-r2.json: output_throughput=28.46 tok/s completed=1 accept=2.89375 errors=None